In [21]:
import pandas as pd

In [22]:
df = pd.read_csv('titanic.csv')

In [23]:
list(df.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [24]:
df.loc[99]

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [54]:
df.loc[5, 'Age'] = '27'
df.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                          27
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [64]:
(pd.to_numeric(df["Age"]) > 18).sum()

576

In [65]:
((df["Sex"] == 'male').sum())/len(df)*100

64.75869809203144

In [88]:
df['Pclass'].value_counts().sort_index().reset_index(name='Number of Passengers').rename(columns={'index': 'Class'})

   Class  Number of Passengers
0      1                   216
1      2                   184
2      3                   491

In [85]:
(df['Embarked'].value_counts(normalize=True) * 100).reset_index().rename(columns={'index': 'Embarked', 'Embarked': 'Percentage of Passengers'})

  Embarked  Percentage of Passengers
0        S                 72.440945
1        C                 18.897638
2        Q                  8.661417